app/Http/Controllers/AuthController.php

insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('mamamaam', 'asdasd@baba', 'yxQOVB6CGszTxEnk2SoOOn2iYTJ.VeGCCEMA5vKAXX7Rdj62AJE2', '2021-03-15 21:19:45', '2021-03-15 21:19:45')
---
    public function register(Request $request) {
        $user = new User();
        $user->name = $request->login;
        $user->email = $request->email;
        $user->password = bcrypt($request->password);
        $user->save();