app/Http/Controllers/DealerController.php

select * from `dealers`
---
    public function get() {
        return ['dealers' => Dealer::all()];