app/Http/Controllers/DepartmentController.php

    public function departmentInfo() {
       return  [
        'departments' => Department::all(),
        'products' => Product::all(),
        'dealers' => Dealer::all(),
        'statuses' => Status::all(),
        'storage_path' => public_path()
       ];
---
select * from `departments`
select * from `products`
select * from `dealers`
select * from `statuses`