app/Http/Controllers/ProductController.php

select * from `products`
---
    public function get() {
        return [ 'products' => Product::all()];

select `name` from `categories`
---
    public function getCategories() {
        return Category::all('name');