app/Http/Controllers/RolesController.php

    public function get(Request $request) {
        return ['roles' => Role::all('name') ];
---
select `name` from `roles`